&НаКлиенте
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ОбъектыНазначения) Экспорт 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтветНаВопросЗавершение", ЭтаФорма, ОбъектыНазначения[0]);
	
	
	ПоказатьВопрос(ОписаниеОповещения, "Данные будут перезаписаны. Вы уверены что необходимо загрузить новые данные?", РежимДиалогаВопрос.ДаНет,,,"Внимание!");  
	
		
	КонецПроцедуры     
	
	&НаКлиенте
	Процедура ОтветНаВопросЗавершение(Результат, ДопПараметр)  Экспорт
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ДокументРодитель", ДопПараметр);
	
		Если Результат = КодВозвратаДиалога.Да Тогда 
			
		     	ОткрытьФорму(
			"ВнешняяОбработка.ЗагрузкаТоваровИзExcel.Форма.Форма",СтруктураПараметров,,,,,,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
		);
 	
		   
		   КонецЕсли;
	
	КонецПроцедуры // ОтветНаВопросЗавершение()


&НаКлиенте
Процедура ЗагрузитьФайл(Команда)    
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЧтениеФайлаExcelЗавершение", ЭтаФорма);
	НачатьПомещениеФайла(ОписаниеОповещения,, ПутьКФайлу, Ложь);
		
	КонецПроцедуры


&НаКлиенте
	Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		ДиалогОткрытия = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДиалогОткрытия.Фильтр = "excel|*.xlsx";
		ДиалогОткрытия.Заголовок = "Откройте файл Excel";
		ДиалогОткрытия.МножественныйВыбор = Ложь;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытиеФайлаExcelЗавершение", ЭтаФорма);
		ДиалогОткрытия.Показать(ОписаниеОповещения);
		
		
		
	КонецПроцедуры      
	

&НаКлиенте
Процедура ОткрытиеФайлаExcelЗавершение(ВыбранныеФайлы, ДопПараметры) Экспорт     
	
	Если ВыбранныеФайлы <> Неопределено Тогда   
		ПутьКФайлу = ВыбранныеФайлы[0];	
	КонецЕсли;

	

КонецПроцедуры // ОткрытиеФайлаExcelЗавершение()  

&НаКлиенте
Процедура ЧтениеФайлаExcelЗавершение(Результат, АдресВоВременномХранилище, ПомещаемыйФайл, ДопПараметры) Экспорт 
	
         ЗагрузкаДанныхИзExcel(АдресВоВременномХранилище);
	

КонецПроцедуры // ЧтениеФайлаExcelЗавершение()    

&НаСервере
Процедура ЗагрузкаДанныхИзExcel(АдресФайла)

	 ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");
	 ДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайла);
	 
	 ДанныеФайла.Записать(ИмяВременногоФайла);
	 
	 ТабДок = Новый ТабличныйДокумент;
	 ТабДок.Прочитать(ИмяВременногоФайла);
	 ПЗ = Новый ПостроительЗапроса;
	 ПЗ.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабДок.Область());
	 ПЗ.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;
	 ПЗ.ЗаполнитьНастройки();
	 ПЗ.Выполнить();
	 ТаблицаЗначений = ПЗ.Результат.Выгрузить();   
	 
	 ЗагруженныеДанные.Очистить();
	  
	 Для каждого Строка Из ТаблицаЗначений Цикл
	 
	 	НоваяСтрока = ЗагруженныеДанные.Добавить();
		НоваяСтрока.НаименованиеИзExcel = Строка.Номенклатура;  
		НоваяСтрока.Количество = Строка.Количество;
		
	    НоваяСтрока.НоменклатураИзБазы = Справочники.Номенклатура.НайтиПоНаименованию(Строка.Номенклатура);	
		
		
	 
	 КонецЦикла;
	 
 КонецПроцедуры // ЗагрузкаДанныхИзExcel()   

&НаКлиенте
 Процедура ЗагрузитьВДокумент(Команда)
	 
	 ПараметрыФормы = Новый Структура;
	 ПараметрыФормы.Вставить("Ключ", Параметры.ДокументРодитель);
	 ФормаДокумента = ПолучитьФорму("Документ.ЗаказПокупателя.ФормаОбъекта", ПараметрыФормы); 
	 ОбъектФормы = ФормаДокумента.Объект;
	 ОбъектФормы.Запасы.Очистить();
	 Для каждого Строка Из ЗагруженныеДанные Цикл
	 
	 	НоваяСтрока = ОбъектФормы.Запасы.Добавить();
		НоваяСтрока.Номенклатура = Строка.НоменклатураИзБазы;   
		НоваяСтрока.Количество = Строка.Количество;

	 
	 КонецЦикла;
	    КопироватьДанныеФормы(ОбъектФормы, ФормаДокумента.Объект);
		ОповеститьОбИзменении(Параметры.ДокументРодитель);
		Закрыть();
	 
 КонецПроцедуры
 


	
	
	
	
